akobyl/TM4C129_FreeRTOS_Demo/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the SSI API.
//
//*****************************************************************************
#ifdef ROM_SSIDataPut
#define MAP_SSIDataPut                                                        \
        ROM_SSIDataPut
#else
#define MAP_SSIDataPut                                                        \
        SSIDataPut
#endif
#ifdef ROM_SSIConfigSetExpClk
#define MAP_SSIConfigSetExpClk                                                \
        ROM_SSIConfigSetExpClk
#else
#define MAP_SSIConfigSetExpClk                                                \
        SSIConfigSetExpClk
#endif
#ifdef ROM_SSIEnable
#define MAP_SSIEnable                                                         \
        ROM_SSIEnable
#else
#define MAP_SSIEnable                                                         \
        SSIEnable
#endif
#ifdef ROM_SSIDisable
#define MAP_SSIDisable                                                        \
        ROM_SSIDisable
#else
#define MAP_SSIDisable                                                        \
        SSIDisable
#endif
#ifdef ROM_SSIIntEnable
#define MAP_SSIIntEnable                                                      \
        ROM_SSIIntEnable
#else
#define MAP_SSIIntEnable                                                      \
        SSIIntEnable
#endif
#ifdef ROM_SSIIntDisable
#define MAP_SSIIntDisable                                                     \
        ROM_SSIIntDisable
#else
#define MAP_SSIIntDisable                                                     \
        SSIIntDisable
#endif
#ifdef ROM_SSIIntStatus
#define MAP_SSIIntStatus                                                      \
        ROM_SSIIntStatus
#else
#define MAP_SSIIntStatus                                                      \
        SSIIntStatus
#endif
#ifdef ROM_SSIIntClear
#define MAP_SSIIntClear                                                       \
        ROM_SSIIntClear
#else
#define MAP_SSIIntClear                                                       \
        SSIIntClear
#endif
#ifdef ROM_SSIDataPutNonBlocking
#define MAP_SSIDataPutNonBlocking                                             \
        ROM_SSIDataPutNonBlocking
#else
#define MAP_SSIDataPutNonBlocking                                             \
        SSIDataPutNonBlocking
#endif
#ifdef ROM_SSIDataGet
#define MAP_SSIDataGet                                                        \
        ROM_SSIDataGet
#else
#define MAP_SSIDataGet                                                        \
        SSIDataGet
#endif
#ifdef ROM_SSIDataGetNonBlocking
#define MAP_SSIDataGetNonBlocking                                             \
        ROM_SSIDataGetNonBlocking
#else
#define MAP_SSIDataGetNonBlocking                                             \
        SSIDataGetNonBlocking
#endif
#ifdef ROM_SSIDMAEnable
#define MAP_SSIDMAEnable                                                      \
        ROM_SSIDMAEnable
#else
#define MAP_SSIDMAEnable                                                      \
        SSIDMAEnable
#endif
#ifdef ROM_SSIDMADisable
#define MAP_SSIDMADisable                                                     \
        ROM_SSIDMADisable
#else
#define MAP_SSIDMADisable                                                     \
        SSIDMADisable
#endif
#ifdef ROM_SSIBusy
#define MAP_SSIBusy                                                           \
        ROM_SSIBusy
#else
#define MAP_SSIBusy                                                           \
        SSIBusy
#endif
#ifdef ROM_SSIClockSourceGet
#define MAP_SSIClockSourceGet                                                 \
        ROM_SSIClockSourceGet
#else
#define MAP_SSIClockSourceGet                                                 \
        SSIClockSourceGet
#endif
#ifdef ROM_SSIClockSourceSet
#define MAP_SSIClockSourceSet                                                 \
        ROM_SSIClockSourceSet
#else
#define MAP_SSIClockSourceSet                                                 \
        SSIClockSourceSet
#endif
#ifdef ROM_SSIAdvModeSet
#define MAP_SSIAdvModeSet                                                     \
        ROM_SSIAdvModeSet
#else
#define MAP_SSIAdvModeSet                                                     \
        SSIAdvModeSet
#endif
#ifdef ROM_SSIAdvDataPutFrameEnd
#define MAP_SSIAdvDataPutFrameEnd                                             \
        ROM_SSIAdvDataPutFrameEnd
#else
#define MAP_SSIAdvDataPutFrameEnd                                             \
        SSIAdvDataPutFrameEnd
#endif
#ifdef ROM_SSIAdvDataPutFrameEndNonBlocking
#define MAP_SSIAdvDataPutFrameEndNonBlocking                                  \
        ROM_SSIAdvDataPutFrameEndNonBlocking
#else
#define MAP_SSIAdvDataPutFrameEndNonBlocking                                  \
        SSIAdvDataPutFrameEndNonBlocking
#endif
#ifdef ROM_SSIAdvFrameHoldEnable
#define MAP_SSIAdvFrameHoldEnable                                             \
        ROM_SSIAdvFrameHoldEnable
#else
#define MAP_SSIAdvFrameHoldEnable                                             \
        SSIAdvFrameHoldEnable
#endif
#ifdef ROM_SSIAdvFrameHoldDisable
#define MAP_SSIAdvFrameHoldDisable                                            \
        ROM_SSIAdvFrameHoldDisable
#else
#define MAP_SSIAdvFrameHoldDisable                                            \
        SSIAdvFrameHoldDisable
#endif

//*****************************************************************************
//
// Macros for the SysCtl API.
//
//*****************************************************************************
#ifdef ROM_SysCtlSleep
#define MAP_SysCtlSleep                                                       \
        ROM_SysCtlSleep
#else
#define MAP_SysCtlSleep                                                       \
        SysCtlSleep
#endif
#ifdef ROM_SysCtlSRAMSizeGet
#define MAP_SysCtlSRAMSizeGet                                                 \
        ROM_SysCtlSRAMSizeGet
#else
#define MAP_SysCtlSRAMSizeGet                                                 \
        SysCtlSRAMSizeGet
#endif
#ifdef ROM_SysCtlFlashSizeGet
#define MAP_SysCtlFlashSizeGet                                                \
        ROM_SysCtlFlashSizeGet
#else
#define MAP_SysCtlFlashSizeGet                                                \
        SysCtlFlashSizeGet
#endif
#ifdef ROM_SysCtlPeripheralPresent
#define MAP_SysCtlPeripheralPresent                                           \
        ROM_SysCtlPeripheralPresent
#else
#define MAP_SysCtlPeripheralPresent                                           \
        SysCtlPeripheralPresent
#endif
#ifdef ROM_SysCtlPeripheralReset
#define MAP_SysCtlPeripheralReset                                             \
        ROM_SysCtlPeripheralReset
#else
#define MAP_SysCtlPeripheralReset                                             \
        SysCtlPeripheralReset
#endif
#ifdef ROM_SysCtlPeripheralEnable
#define MAP_SysCtlPeripheralEnable                                            \
        ROM_SysCtlPeripheralEnable
#else
#define MAP_SysCtlPeripheralEnable                                            \
        SysCtlPeripheralEnable
#endif
#ifdef ROM_SysCtlPeripheralDisable
#define MAP_SysCtlPeripheralDisable                                           \
        ROM_SysCtlPeripheralDisable
#else
#define MAP_SysCtlPeripheralDisable                                           \
        SysCtlPeripheralDisable
#endif
#ifdef ROM_SysCtlPeripheralSleepEnable
#define MAP_SysCtlPeripheralSleepEnable                                       \
        ROM_SysCtlPeripheralSleepEnable
#else
#define MAP_SysCtlPeripheralSleepEnable                                       \
        SysCtlPeripheralSleepEnable
#endif
#ifdef ROM_SysCtlPeripheralSleepDisable
#define MAP_SysCtlPeripheralSleepDisable                                      \
        ROM_SysCtlPeripheralSleepDisable
#else
#define MAP_SysCtlPeripheralSleepDisable                                      \
        SysCtlPeripheralSleepDisable
#endif
#ifdef ROM_SysCtlPeripheralDeepSleepEnable
#define MAP_SysCtlPeripheralDeepSleepEnable                                   \
        ROM_SysCtlPeripheralDeepSleepEnable
#else
#define MAP_SysCtlPeripheralDeepSleepEnable                                   \
        SysCtlPeripheralDeepSleepEnable
#endif
#ifdef ROM_SysCtlPeripheralDeepSleepDisable
#define MAP_SysCtlPeripheralDeepSleepDisable                                  \
        ROM_SysCtlPeripheralDeepSleepDisable
#else
#define MAP_SysCtlPeripheralDeepSleepDisable                                  \
        SysCtlPeripheralDeepSleepDisable
#endif
#ifdef ROM_SysCtlPeripheralClockGating
#define MAP_SysCtlPeripheralClockGating                                       \
        ROM_SysCtlPeripheralClockGating
#else
#define MAP_SysCtlPeripheralClockGating                                       \
        SysCtlPeripheralClockGating
#endif
#ifdef ROM_SysCtlIntEnable
#define MAP_SysCtlIntEnable                                                   \
        ROM_SysCtlIntEnable
#else
#define MAP_SysCtlIntEnable                                                   \
        SysCtlIntEnable
#endif
#ifdef ROM_SysCtlIntDisable
#define MAP_SysCtlIntDisable                                                  \
        ROM_SysCtlIntDisable
#else
#define MAP_SysCtlIntDisable                                                  \
        SysCtlIntDisable
#endif
#ifdef ROM_SysCtlIntClear
#define MAP_SysCtlIntClear                                                    \
        ROM_SysCtlIntClear
#else
#define MAP_SysCtlIntClear                                                    \
        SysCtlIntClear
#endif
#ifdef ROM_SysCtlIntStatus
#define MAP_SysCtlIntStatus                                                   \
        ROM_SysCtlIntStatus
#else
#define MAP_SysCtlIntStatus                                                   \
        SysCtlIntStatus
#endif
#ifdef ROM_SysCtlReset
#define MAP_SysCtlReset                                                       \
        ROM_SysCtlReset
#else
#define MAP_SysCtlReset                                                       \
        SysCtlReset
#endif
#ifdef ROM_SysCtlDeepSleep
#define MAP_SysCtlDeepSleep                                                   \
        ROM_SysCtlDeepSleep
#else
#define MAP_SysCtlDeepSleep                                                   \
        SysCtlDeepSleep
#endif
#ifdef ROM_SysCtlResetCauseGet
#define MAP_SysCtlResetCauseGet                                               \
        ROM_SysCtlResetCauseGet
#else
#define MAP_SysCtlResetCauseGet                                               \
        SysCtlResetCauseGet
#endif
#ifdef ROM_SysCtlResetCauseClear
#define MAP_SysCtlResetCauseClear                                             \
        ROM_SysCtlResetCauseClear
#else
#define MAP_SysCtlResetCauseClear                                             \
        SysCtlResetCauseClear
#endif
#ifdef ROM_SysCtlClockSet
#define MAP_SysCtlClockSet                                                    \
        ROM_SysCtlClockSet
#else
#define MAP_SysCtlClockSet                                                    \
        SysCtlClockSet
#endif
#ifdef ROM_SysCtlClockGet
#define MAP_SysCtlClockGet                                                    \
        ROM_SysCtlClockGet
#else
#define MAP_SysCtlClockGet                                                    \
        SysCtlClockGet
#endif
#ifdef ROM_SysCtlPWMClockSet
#define MAP_SysCtlPWMClockSet                                                 \
        ROM_SysCtlPWMClockSet
#else
#define MAP_SysCtlPWMClockSet                                                 \
        SysCtlPWMClockSet
#endif
#ifdef ROM_SysCtlPWMClockGet
#define MAP_SysCtlPWMClockGet                                                 \
        ROM_SysCtlPWMClockGet
#else
#define MAP_SysCtlPWMClockGet                                                 \
        SysCtlPWMClockGet
#endif
#ifdef ROM_SysCtlUSBPLLEnable
#define MAP_SysCtlUSBPLLEnable                                                \
        ROM_SysCtlUSBPLLEnable
#else
#define MAP_SysCtlUSBPLLEnable                                                \
        SysCtlUSBPLLEnable
#endif
#ifdef ROM_SysCtlUSBPLLDisable
#define MAP_SysCtlUSBPLLDisable                                               \
        ROM_SysCtlUSBPLLDisable
#else
#define MAP_SysCtlUSBPLLDisable                                               \
        SysCtlUSBPLLDisable
#endif
#ifdef ROM_SysCtlDelay
#define MAP_SysCtlDelay                                                       \
        ROM_SysCtlDelay
#else
#define MAP_SysCtlDelay                                                       \
        SysCtlDelay
#endif
#ifdef ROM_SysCtlPeripheralReady
#define MAP_SysCtlPeripheralReady                                             \
        ROM_SysCtlPeripheralReady
#else
#define MAP_SysCtlPeripheralReady                                             \
        SysCtlPeripheralReady
#endif
#ifdef ROM_SysCtlPeripheralPowerOn
#define MAP_SysCtlPeripheralPowerOn                                           \
        ROM_SysCtlPeripheralPowerOn
#else
#define MAP_SysCtlPeripheralPowerOn                                           \
        SysCtlPeripheralPowerOn
#endif
#ifdef ROM_SysCtlPeripheralPowerOff
#define MAP_SysCtlPeripheralPowerOff                                          \
        ROM_SysCtlPeripheralPowerOff
#else
#define MAP_SysCtlPeripheralPowerOff                                          \
        SysCtlPeripheralPowerOff
#endif
#ifdef ROM_SysCtlMOSCConfigSet
#define MAP_SysCtlMOSCConfigSet                                               \
        ROM_SysCtlMOSCConfigSet
#else
#define MAP_SysCtlMOSCConfigSet                                               \
        SysCtlMOSCConfigSet
#endif
#ifdef ROM_SysCtlPIOSCCalibrate
#define MAP_SysCtlPIOSCCalibrate                                              \
        ROM_SysCtlPIOSCCalibrate
#else
#define MAP_SysCtlPIOSCCalibrate                                              \
        SysCtlPIOSCCalibrate
#endif
#ifdef ROM_SysCtlDeepSleepClockSet
#define MAP_SysCtlDeepSleepClockSet                                           \
        ROM_SysCtlDeepSleepClockSet
#else
#define MAP_SysCtlDeepSleepClockSet                                           \
        SysCtlDeepSleepClockSet
#endif
#ifdef ROM_SysCtlDeepSleepClockConfigSet
#define MAP_SysCtlDeepSleepClockConfigSet                                     \
        ROM_SysCtlDeepSleepClockConfigSet
#else
#define MAP_SysCtlDeepSleepClockConfigSet                                     \
        SysCtlDeepSleepClockConfigSet
#endif
#ifdef ROM_SysCtlClockFreqSet
#define MAP_SysCtlClockFreqSet                                                \
        ROM_SysCtlClockFreqSet
#else
#define MAP_SysCtlClockFreqSet                                                \
        SysCtlClockFreqSet
#endif
#ifdef ROM_SysCtlResetBehaviorSet
#define MAP_SysCtlResetBehaviorSet                                            \
        ROM_SysCtlResetBehaviorSet
#else
#define MAP_SysCtlResetBehaviorSet                                            \
        SysCtlResetBehaviorSet
#endif
#ifdef ROM_SysCtlResetBehaviorGet
#define MAP_SysCtlResetBehaviorGet                                            \
        ROM_SysCtlResetBehaviorGet
#else
#define MAP_SysCtlResetBehaviorGet                                            \
        SysCtlResetBehaviorGet
#endif
#ifdef ROM_SysCtlFlashSectorSizeGet
#define MAP_SysCtlFlashSectorSizeGet                                          \
        ROM_SysCtlFlashSectorSizeGet
#else
#define MAP_SysCtlFlashSectorSizeGet                                          \
        SysCtlFlashSectorSizeGet
#endif
#ifdef ROM_SysCtlVoltageEventConfig
#define MAP_SysCtlVoltageEventConfig                                          \
        ROM_SysCtlVoltageEventConfig
#else
#define MAP_SysCtlVoltageEventConfig                                          \
        SysCtlVoltageEventConfig
#endif
#ifdef ROM_SysCtlVoltageEventStatus
#define MAP_SysCtlVoltageEventStatus                                          \
        ROM_SysCtlVoltageEventStatus
#else
#define MAP_SysCtlVoltageEventStatus                                          \
        SysCtlVoltageEventStatus
#endif
#ifdef ROM_SysCtlVoltageEventClear
#define MAP_SysCtlVoltageEventClear                                           \
        ROM_SysCtlVoltageEventClear
#else
#define MAP_SysCtlVoltageEventClear                                           \
        SysCtlVoltageEventClear
#endif
#ifdef ROM_SysCtlNMIStatus
#define MAP_SysCtlNMIStatus                                                   \
        ROM_SysCtlNMIStatus
#else
#define MAP_SysCtlNMIStatus                                                   \
        SysCtlNMIStatus
#endif
#ifdef ROM_SysCtlNMIClear
#define MAP_SysCtlNMIClear                                                    \
        ROM_SysCtlNMIClear
#else
#define MAP_SysCtlNMIClear                                                    \
        SysCtlNMIClear
#endif
#ifdef ROM_SysCtlClockOutConfig
#define MAP_SysCtlClockOutConfig                                              \
        ROM_SysCtlClockOutConfig
#else
#define MAP_SysCtlClockOutConfig                                              \
        SysCtlClockOutConfig
#endif
#ifdef ROM_SysCtlAltClkConfig
#define MAP_SysCtlAltClkConfig                                                \
        ROM_SysCtlAltClkConfig
#else
#define MAP_SysCtlAltClkConfig                                                \
        SysCtlAltClkConfig
#endif

//*****************************************************************************
//
// Macros for the SysExc API.
//
//*****************************************************************************
#ifdef ROM_SysExcIntStatus
#define MAP_SysExcIntStatus                                                   \
        ROM_SysExcIntStatus
#else
#define MAP_SysExcIntStatus                                                   \
        SysExcIntStatus
#endif
#ifdef ROM_SysExcIntClear
#define MAP_SysExcIntClear                                                    \
        ROM_SysExcIntClear
#else
#define MAP_SysExcIntClear                                                    \
        SysExcIntClear
#endif
#ifdef ROM_SysExcIntDisable
#define MAP_SysExcIntDisable                                                  \
        ROM_SysExcIntDisable
#else
#define MAP_SysExcIntDisable                                                  \
        SysExcIntDisable
#endif
#ifdef ROM_SysExcIntEnable
#define MAP_SysExcIntEnable                                                   \
        ROM_SysExcIntEnable
#else
#define MAP_SysExcIntEnable                                                   \
        SysExcIntEnable
#endif

//*****************************************************************************
//
// Macros for the SysTick API.
//
//*****************************************************************************
#ifdef ROM_SysTickValueGet
#define MAP_SysTickValueGet                                                   \
        ROM_SysTickValueGet
#else
#define MAP_SysTickValueGet                                                   \
        SysTickValueGet
#endif
#ifdef ROM_SysTickEnable
#define MAP_SysTickEnable                                                     \
        ROM_SysTickEnable
#else
#define MAP_SysTickEnable                                                     \
        SysTickEnable
#endif
#ifdef ROM_SysTickDisable
#define MAP_SysTickDisable                                                    \
        ROM_SysTickDisable
#else
#define MAP_SysTickDisable                                                    \
        SysTickDisable
#endif
#ifdef ROM_SysTickIntEnable
#define MAP_SysTickIntEnable                                                  \
        ROM_SysTickIntEnable
#else
#define MAP_SysTickIntEnable                                                  \
        SysTickIntEnable
#endif
#ifdef ROM_SysTickIntDisable
#define MAP_SysTickIntDisable                                                 \
        ROM_SysTickIntDisable
#else
#define MAP_SysTickIntDisable                                                 \
        SysTickIntDisable
#endif
#ifdef ROM_SysTickPeriodSet
#define MAP_SysTickPeriodSet                                                  \
        ROM_SysTickPeriodSet
#else
#define MAP_SysTickPeriodSet                                                  \
        SysTickPeriodSet
#endif
#ifdef ROM_SysTickPeriodGet
#define MAP_SysTickPeriodGet                                                  \
        ROM_SysTickPeriodGet
#else
#define MAP_SysTickPeriodGet                                                  \
        SysTickPeriodGet
#endif

