akobyl/TM4C129_FreeRTOS_Demo/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the USB API.
//
//*****************************************************************************
#ifdef ROM_USBDevAddrGet
#define MAP_USBDevAddrGet                                                     \
        ROM_USBDevAddrGet
#else
#define MAP_USBDevAddrGet                                                     \
        USBDevAddrGet
#endif
#ifdef ROM_USBDevAddrSet
#define MAP_USBDevAddrSet                                                     \
        ROM_USBDevAddrSet
#else
#define MAP_USBDevAddrSet                                                     \
        USBDevAddrSet
#endif
#ifdef ROM_USBDevConnect
#define MAP_USBDevConnect                                                     \
        ROM_USBDevConnect
#else
#define MAP_USBDevConnect                                                     \
        USBDevConnect
#endif
#ifdef ROM_USBDevDisconnect
#define MAP_USBDevDisconnect                                                  \
        ROM_USBDevDisconnect
#else
#define MAP_USBDevDisconnect                                                  \
        USBDevDisconnect
#endif
#ifdef ROM_USBDevEndpointConfigSet
#define MAP_USBDevEndpointConfigSet                                           \
        ROM_USBDevEndpointConfigSet
#else
#define MAP_USBDevEndpointConfigSet                                           \
        USBDevEndpointConfigSet
#endif
#ifdef ROM_USBDevEndpointDataAck
#define MAP_USBDevEndpointDataAck                                             \
        ROM_USBDevEndpointDataAck
#else
#define MAP_USBDevEndpointDataAck                                             \
        USBDevEndpointDataAck
#endif
#ifdef ROM_USBDevEndpointStall
#define MAP_USBDevEndpointStall                                               \
        ROM_USBDevEndpointStall
#else
#define MAP_USBDevEndpointStall                                               \
        USBDevEndpointStall
#endif
#ifdef ROM_USBDevEndpointStallClear
#define MAP_USBDevEndpointStallClear                                          \
        ROM_USBDevEndpointStallClear
#else
#define MAP_USBDevEndpointStallClear                                          \
        USBDevEndpointStallClear
#endif
#ifdef ROM_USBDevEndpointStatusClear
#define MAP_USBDevEndpointStatusClear                                         \
        ROM_USBDevEndpointStatusClear
#else
#define MAP_USBDevEndpointStatusClear                                         \
        USBDevEndpointStatusClear
#endif
#ifdef ROM_USBEndpointDataGet
#define MAP_USBEndpointDataGet                                                \
        ROM_USBEndpointDataGet
#else
#define MAP_USBEndpointDataGet                                                \
        USBEndpointDataGet
#endif
#ifdef ROM_USBEndpointDataPut
#define MAP_USBEndpointDataPut                                                \
        ROM_USBEndpointDataPut
#else
#define MAP_USBEndpointDataPut                                                \
        USBEndpointDataPut
#endif
#ifdef ROM_USBEndpointDataSend
#define MAP_USBEndpointDataSend                                               \
        ROM_USBEndpointDataSend
#else
#define MAP_USBEndpointDataSend                                               \
        USBEndpointDataSend
#endif
#ifdef ROM_USBEndpointDataToggleClear
#define MAP_USBEndpointDataToggleClear                                        \
        ROM_USBEndpointDataToggleClear
#else
#define MAP_USBEndpointDataToggleClear                                        \
        USBEndpointDataToggleClear
#endif
#ifdef ROM_USBEndpointStatus
#define MAP_USBEndpointStatus                                                 \
        ROM_USBEndpointStatus
#else
#define MAP_USBEndpointStatus                                                 \
        USBEndpointStatus
#endif
#ifdef ROM_USBFIFOAddrGet
#define MAP_USBFIFOAddrGet                                                    \
        ROM_USBFIFOAddrGet
#else
#define MAP_USBFIFOAddrGet                                                    \
        USBFIFOAddrGet
#endif
#ifdef ROM_USBFIFOConfigGet
#define MAP_USBFIFOConfigGet                                                  \
        ROM_USBFIFOConfigGet
#else
#define MAP_USBFIFOConfigGet                                                  \
        USBFIFOConfigGet
#endif
#ifdef ROM_USBFIFOConfigSet
#define MAP_USBFIFOConfigSet                                                  \
        ROM_USBFIFOConfigSet
#else
#define MAP_USBFIFOConfigSet                                                  \
        USBFIFOConfigSet
#endif
#ifdef ROM_USBFIFOFlush
#define MAP_USBFIFOFlush                                                      \
        ROM_USBFIFOFlush
#else
#define MAP_USBFIFOFlush                                                      \
        USBFIFOFlush
#endif
#ifdef ROM_USBFrameNumberGet
#define MAP_USBFrameNumberGet                                                 \
        ROM_USBFrameNumberGet
#else
#define MAP_USBFrameNumberGet                                                 \
        USBFrameNumberGet
#endif
#ifdef ROM_USBHostAddrGet
#define MAP_USBHostAddrGet                                                    \
        ROM_USBHostAddrGet
#else
#define MAP_USBHostAddrGet                                                    \
        USBHostAddrGet
#endif
#ifdef ROM_USBHostAddrSet
#define MAP_USBHostAddrSet                                                    \
        ROM_USBHostAddrSet
#else
#define MAP_USBHostAddrSet                                                    \
        USBHostAddrSet
#endif
#ifdef ROM_USBHostEndpointConfig
#define MAP_USBHostEndpointConfig                                             \
        ROM_USBHostEndpointConfig
#else
#define MAP_USBHostEndpointConfig                                             \
        USBHostEndpointConfig
#endif
#ifdef ROM_USBHostEndpointDataAck
#define MAP_USBHostEndpointDataAck                                            \
        ROM_USBHostEndpointDataAck
#else
#define MAP_USBHostEndpointDataAck                                            \
        USBHostEndpointDataAck
#endif
#ifdef ROM_USBHostEndpointDataToggle
#define MAP_USBHostEndpointDataToggle                                         \
        ROM_USBHostEndpointDataToggle
#else
#define MAP_USBHostEndpointDataToggle                                         \
        USBHostEndpointDataToggle
#endif
#ifdef ROM_USBHostEndpointStatusClear
#define MAP_USBHostEndpointStatusClear                                        \
        ROM_USBHostEndpointStatusClear
#else
#define MAP_USBHostEndpointStatusClear                                        \
        USBHostEndpointStatusClear
#endif
#ifdef ROM_USBHostHubAddrGet
#define MAP_USBHostHubAddrGet                                                 \
        ROM_USBHostHubAddrGet
#else
#define MAP_USBHostHubAddrGet                                                 \
        USBHostHubAddrGet
#endif
#ifdef ROM_USBHostHubAddrSet
#define MAP_USBHostHubAddrSet                                                 \
        ROM_USBHostHubAddrSet
#else
#define MAP_USBHostHubAddrSet                                                 \
        USBHostHubAddrSet
#endif
#ifdef ROM_USBHostPwrDisable
#define MAP_USBHostPwrDisable                                                 \
        ROM_USBHostPwrDisable
#else
#define MAP_USBHostPwrDisable                                                 \
        USBHostPwrDisable
#endif
#ifdef ROM_USBHostPwrEnable
#define MAP_USBHostPwrEnable                                                  \
        ROM_USBHostPwrEnable
#else
#define MAP_USBHostPwrEnable                                                  \
        USBHostPwrEnable
#endif
#ifdef ROM_USBHostPwrConfig
#define MAP_USBHostPwrConfig                                                  \
        ROM_USBHostPwrConfig
#else
#define MAP_USBHostPwrConfig                                                  \
        USBHostPwrConfig
#endif
#ifdef ROM_USBHostPwrFaultDisable
#define MAP_USBHostPwrFaultDisable                                            \
        ROM_USBHostPwrFaultDisable
#else
#define MAP_USBHostPwrFaultDisable                                            \
        USBHostPwrFaultDisable
#endif
#ifdef ROM_USBHostPwrFaultEnable
#define MAP_USBHostPwrFaultEnable                                             \
        ROM_USBHostPwrFaultEnable
#else
#define MAP_USBHostPwrFaultEnable                                             \
        USBHostPwrFaultEnable
#endif
#ifdef ROM_USBHostRequestIN
#define MAP_USBHostRequestIN                                                  \
        ROM_USBHostRequestIN
#else
#define MAP_USBHostRequestIN                                                  \
        USBHostRequestIN
#endif
#ifdef ROM_USBHostRequestStatus
#define MAP_USBHostRequestStatus                                              \
        ROM_USBHostRequestStatus
#else
#define MAP_USBHostRequestStatus                                              \
        USBHostRequestStatus
#endif
#ifdef ROM_USBHostReset
#define MAP_USBHostReset                                                      \
        ROM_USBHostReset
#else
#define MAP_USBHostReset                                                      \
        USBHostReset
#endif
#ifdef ROM_USBHostResume
#define MAP_USBHostResume                                                     \
        ROM_USBHostResume
#else
#define MAP_USBHostResume                                                     \
        USBHostResume
#endif
#ifdef ROM_USBHostSpeedGet
#define MAP_USBHostSpeedGet                                                   \
        ROM_USBHostSpeedGet
#else
#define MAP_USBHostSpeedGet                                                   \
        USBHostSpeedGet
#endif
#ifdef ROM_USBHostSuspend
#define MAP_USBHostSuspend                                                    \
        ROM_USBHostSuspend
#else
#define MAP_USBHostSuspend                                                    \
        USBHostSuspend
#endif
#ifdef ROM_USBDevEndpointConfigGet
#define MAP_USBDevEndpointConfigGet                                           \
        ROM_USBDevEndpointConfigGet
#else
#define MAP_USBDevEndpointConfigGet                                           \
        USBDevEndpointConfigGet
#endif
#ifdef ROM_USBEndpointDMAEnable
#define MAP_USBEndpointDMAEnable                                              \
        ROM_USBEndpointDMAEnable
#else
#define MAP_USBEndpointDMAEnable                                              \
        USBEndpointDMAEnable
#endif
#ifdef ROM_USBEndpointDMADisable
#define MAP_USBEndpointDMADisable                                             \
        ROM_USBEndpointDMADisable
#else
#define MAP_USBEndpointDMADisable                                             \
        USBEndpointDMADisable
#endif
#ifdef ROM_USBEndpointDataAvail
#define MAP_USBEndpointDataAvail                                              \
        ROM_USBEndpointDataAvail
#else
#define MAP_USBEndpointDataAvail                                              \
        USBEndpointDataAvail
#endif
#ifdef ROM_USBOTGHostRequest
#define MAP_USBOTGHostRequest                                                 \
        ROM_USBOTGHostRequest
#else
#define MAP_USBOTGHostRequest                                                 \
        USBOTGHostRequest
#endif
#ifdef ROM_USBModeGet
#define MAP_USBModeGet                                                        \
        ROM_USBModeGet
#else
#define MAP_USBModeGet                                                        \
        USBModeGet
#endif
#ifdef ROM_USBEndpointDMAChannel
#define MAP_USBEndpointDMAChannel                                             \
        ROM_USBEndpointDMAChannel
#else
#define MAP_USBEndpointDMAChannel                                             \
        USBEndpointDMAChannel
#endif
#ifdef ROM_USBIntDisableControl
#define MAP_USBIntDisableControl                                              \
        ROM_USBIntDisableControl
#else
#define MAP_USBIntDisableControl                                              \
        USBIntDisableControl
#endif
#ifdef ROM_USBIntEnableControl
#define MAP_USBIntEnableControl                                               \
        ROM_USBIntEnableControl
#else
#define MAP_USBIntEnableControl                                               \
        USBIntEnableControl
#endif
#ifdef ROM_USBIntStatusControl
#define MAP_USBIntStatusControl                                               \
        ROM_USBIntStatusControl
#else
#define MAP_USBIntStatusControl                                               \
        USBIntStatusControl
#endif
#ifdef ROM_USBIntDisableEndpoint
#define MAP_USBIntDisableEndpoint                                             \
        ROM_USBIntDisableEndpoint
#else
#define MAP_USBIntDisableEndpoint                                             \
        USBIntDisableEndpoint
#endif
#ifdef ROM_USBIntEnableEndpoint
#define MAP_USBIntEnableEndpoint                                              \
        ROM_USBIntEnableEndpoint
#else
#define MAP_USBIntEnableEndpoint                                              \
        USBIntEnableEndpoint
#endif
#ifdef ROM_USBIntStatusEndpoint
#define MAP_USBIntStatusEndpoint                                              \
        ROM_USBIntStatusEndpoint
#else
#define MAP_USBIntStatusEndpoint                                              \
        USBIntStatusEndpoint
#endif
#ifdef ROM_USBHostMode
#define MAP_USBHostMode                                                       \
        ROM_USBHostMode
#else
#define MAP_USBHostMode                                                       \
        USBHostMode
#endif
#ifdef ROM_USBDevMode
#define MAP_USBDevMode                                                        \
        ROM_USBDevMode
#else
#define MAP_USBDevMode                                                        \
        USBDevMode
#endif
#ifdef ROM_USBPHYPowerOff
#define MAP_USBPHYPowerOff                                                    \
        ROM_USBPHYPowerOff
#else
#define MAP_USBPHYPowerOff                                                    \
        USBPHYPowerOff
#endif
#ifdef ROM_USBPHYPowerOn
#define MAP_USBPHYPowerOn                                                     \
        ROM_USBPHYPowerOn
#else
#define MAP_USBPHYPowerOn                                                     \
        USBPHYPowerOn
#endif
#ifdef ROM_USBOTGMode
#define MAP_USBOTGMode                                                        \
        ROM_USBOTGMode
#else
#define MAP_USBOTGMode                                                        \
        USBOTGMode
#endif
#ifdef ROM_USBHostRequestINClear
#define MAP_USBHostRequestINClear                                             \
        ROM_USBHostRequestINClear
#else
#define MAP_USBHostRequestINClear                                             \
        USBHostRequestINClear
#endif
#ifdef ROM_USBNumEndpointsGet
#define MAP_USBNumEndpointsGet                                                \
        ROM_USBNumEndpointsGet
#else
#define MAP_USBNumEndpointsGet                                                \
        USBNumEndpointsGet
#endif
#ifdef ROM_USBClockDisable
#define MAP_USBClockDisable                                                   \
        ROM_USBClockDisable
#else
#define MAP_USBClockDisable                                                   \
        USBClockDisable
#endif
#ifdef ROM_USBClockEnable
#define MAP_USBClockEnable                                                    \
        ROM_USBClockEnable
#else
#define MAP_USBClockEnable                                                    \
        USBClockEnable
#endif
#ifdef ROM_USBControllerVersion
#define MAP_USBControllerVersion                                              \
        ROM_USBControllerVersion
#else
#define MAP_USBControllerVersion                                              \
        USBControllerVersion
#endif
#ifdef ROM_USBDevLPMConfig
#define MAP_USBDevLPMConfig                                                   \
        ROM_USBDevLPMConfig
#else
#define MAP_USBDevLPMConfig                                                   \
        USBDevLPMConfig
#endif
#ifdef ROM_USBDevLPMDisable
#define MAP_USBDevLPMDisable                                                  \
        ROM_USBDevLPMDisable
#else
#define MAP_USBDevLPMDisable                                                  \
        USBDevLPMDisable
#endif
#ifdef ROM_USBDevLPMEnable
#define MAP_USBDevLPMEnable                                                   \
        ROM_USBDevLPMEnable
#else
#define MAP_USBDevLPMEnable                                                   \
        USBDevLPMEnable
#endif
#ifdef ROM_USBDevLPMRemoteWake
#define MAP_USBDevLPMRemoteWake                                               \
        ROM_USBDevLPMRemoteWake
#else
#define MAP_USBDevLPMRemoteWake                                               \
        USBDevLPMRemoteWake
#endif
#ifdef ROM_USBDevSpeedGet
#define MAP_USBDevSpeedGet                                                    \
        ROM_USBDevSpeedGet
#else
#define MAP_USBDevSpeedGet                                                    \
        USBDevSpeedGet
#endif
#ifdef ROM_USBDMAChannelAddressGet
#define MAP_USBDMAChannelAddressGet                                           \
        ROM_USBDMAChannelAddressGet
#else
#define MAP_USBDMAChannelAddressGet                                           \
        USBDMAChannelAddressGet
#endif
#ifdef ROM_USBDMAChannelAddressSet
#define MAP_USBDMAChannelAddressSet                                           \
        ROM_USBDMAChannelAddressSet
#else
#define MAP_USBDMAChannelAddressSet                                           \
        USBDMAChannelAddressSet
#endif
#ifdef ROM_USBDMAChannelConfigSet
#define MAP_USBDMAChannelConfigSet                                            \
        ROM_USBDMAChannelConfigSet
#else
#define MAP_USBDMAChannelConfigSet                                            \
        USBDMAChannelConfigSet
#endif
#ifdef ROM_USBDMAChannelDisable
#define MAP_USBDMAChannelDisable                                              \
        ROM_USBDMAChannelDisable
#else
#define MAP_USBDMAChannelDisable                                              \
        USBDMAChannelDisable
#endif
#ifdef ROM_USBDMAChannelEnable
#define MAP_USBDMAChannelEnable                                               \
        ROM_USBDMAChannelEnable
#else
#define MAP_USBDMAChannelEnable                                               \
        USBDMAChannelEnable
#endif
#ifdef ROM_USBDMAChannelIntDisable
#define MAP_USBDMAChannelIntDisable                                           \
        ROM_USBDMAChannelIntDisable
#else
#define MAP_USBDMAChannelIntDisable                                           \
        USBDMAChannelIntDisable
#endif
#ifdef ROM_USBDMAChannelIntEnable
#define MAP_USBDMAChannelIntEnable                                            \
        ROM_USBDMAChannelIntEnable
#else
#define MAP_USBDMAChannelIntEnable                                            \
        USBDMAChannelIntEnable
#endif
#ifdef ROM_USBDMAChannelCountGet
#define MAP_USBDMAChannelCountGet                                             \
        ROM_USBDMAChannelCountGet
#else
#define MAP_USBDMAChannelCountGet                                             \
        USBDMAChannelCountGet
#endif
#ifdef ROM_USBDMAChannelCountSet
#define MAP_USBDMAChannelCountSet                                             \
        ROM_USBDMAChannelCountSet
#else
#define MAP_USBDMAChannelCountSet                                             \
        USBDMAChannelCountSet
#endif
#ifdef ROM_USBDMAChannelIntStatus
#define MAP_USBDMAChannelIntStatus                                            \
        ROM_USBDMAChannelIntStatus
#else
#define MAP_USBDMAChannelIntStatus                                            \
        USBDMAChannelIntStatus
#endif
#ifdef ROM_USBDMAChannelStatus
#define MAP_USBDMAChannelStatus                                               \
        ROM_USBDMAChannelStatus
#else
#define MAP_USBDMAChannelStatus                                               \
        USBDMAChannelStatus
#endif
#ifdef ROM_USBDMAChannelStatusClear
#define MAP_USBDMAChannelStatusClear                                          \
        ROM_USBDMAChannelStatusClear
#else
#define MAP_USBDMAChannelStatusClear                                          \
        USBDMAChannelStatusClear
#endif
#ifdef ROM_USBHighSpeed
#define MAP_USBHighSpeed                                                      \
        ROM_USBHighSpeed
#else
#define MAP_USBHighSpeed                                                      \
        USBHighSpeed
#endif
#ifdef ROM_USBHostEndpointPing
#define MAP_USBHostEndpointPing                                               \
        ROM_USBHostEndpointPing
#else
#define MAP_USBHostEndpointPing                                               \
        USBHostEndpointPing
#endif
#ifdef ROM_USBHostEndpointSpeed
#define MAP_USBHostEndpointSpeed                                              \
        ROM_USBHostEndpointSpeed
#else
#define MAP_USBHostEndpointSpeed                                              \
        USBHostEndpointSpeed
#endif
#ifdef ROM_USBHostLPMConfig
#define MAP_USBHostLPMConfig                                                  \
        ROM_USBHostLPMConfig
#else
#define MAP_USBHostLPMConfig                                                  \
        USBHostLPMConfig
#endif
#ifdef ROM_USBHostLPMResume
#define MAP_USBHostLPMResume                                                  \
        ROM_USBHostLPMResume
#else
#define MAP_USBHostLPMResume                                                  \
        USBHostLPMResume
#endif
#ifdef ROM_USBHostLPMSend
#define MAP_USBHostLPMSend                                                    \
        ROM_USBHostLPMSend
#else
#define MAP_USBHostLPMSend                                                    \
        USBHostLPMSend
#endif
#ifdef ROM_USBLPMIntDisable
#define MAP_USBLPMIntDisable                                                  \
        ROM_USBLPMIntDisable
#else
#define MAP_USBLPMIntDisable                                                  \
        USBLPMIntDisable
#endif
#ifdef ROM_USBLPMIntEnable
#define MAP_USBLPMIntEnable                                                   \
        ROM_USBLPMIntEnable
#else
#define MAP_USBLPMIntEnable                                                   \
        USBLPMIntEnable
#endif
#ifdef ROM_USBLPMIntStatus
#define MAP_USBLPMIntStatus                                                   \
        ROM_USBLPMIntStatus
#else
#define MAP_USBLPMIntStatus                                                   \
        USBLPMIntStatus
#endif
#ifdef ROM_USBLPMLinkStateGet
#define MAP_USBLPMLinkStateGet                                                \
        ROM_USBLPMLinkStateGet
#else
#define MAP_USBLPMLinkStateGet                                                \
        USBLPMLinkStateGet
#endif
#ifdef ROM_USBEndpointPacketCountSet
#define MAP_USBEndpointPacketCountSet                                         \
        ROM_USBEndpointPacketCountSet
#else
#define MAP_USBEndpointPacketCountSet                                         \
        USBEndpointPacketCountSet
#endif
#ifdef ROM_USBULPIConfig
#define MAP_USBULPIConfig                                                     \
        ROM_USBULPIConfig
#else
#define MAP_USBULPIConfig                                                     \
        USBULPIConfig
#endif
#ifdef ROM_USBULPIDisable
#define MAP_USBULPIDisable                                                    \
        ROM_USBULPIDisable
#else
#define MAP_USBULPIDisable                                                    \
        USBULPIDisable
#endif
#ifdef ROM_USBULPIEnable
